Feature: Търсене и добавяне по категория 

  Scenario: Търсене по категория
    Given Клиента клика върху бутонна "Category"
    When Клиента търси категория "Men dress"
    And Клиента клика върху бутонна "Men dress"
    Then Клиента вижда eкран с артикули от избраната категория
    
  Scenario: Добавяне на артикул
    Given Клиента търси артикул
    When Клиента клика върху артикул "T-shirt" 
    And Клиента въвежда размер на артикул "M"
    And Клиента въвежда колко броя иска от този артикул "3"
    And Клиента клика върху бутонна "add"
    Then Вижда съобщение "Успешно добавен артикул"

  Scenario: Добавяне на артикул без въведен размер
    Given Клиента клика върху артикул "T-shirt" 
    When Клиента въвежда колко броя иска от този артикул "3"
    And Клиента клика върху бутонна "add"
    Then Вижда съобщение "Не сте въвели размер"

  Scenario: Добавяне на артикул без въведен брой
    Given Клиента клика върху артикул "T-shirt" 
    When Клиента въвежда колко броя иска от този артикул "3"
    And Клиента клика върху бутонна "add"
    Then Вижда съобщение "Не сте въвели брой"

    
  Scenario: Добавяне на два различни артикула
    Given Клиента търси два различни артикул
    When Клиента кликва върху първия артикул "T-shirt"
    And Клиента клика върху бутонна "add"
    And Клиента клика върху бутонна "back"
    And Клиента кликва върху втория артикул "denim"
    And Клиента клика върху бутонна "add"
    Then Вижда екран с двата добавени артикула
   
