
Feature: Създаване на поръчка от онлайн магазин 

  Scenario: Вход в онлайн магазина без регистрация
    Given Клиента отваря онлайн страницата на магазина
    When Клиента клика върху линка на онлайн страницата
    And Страницата зарежда
    Then Клиента вижда онлайн страницата на магазина
    
  Scenario: Търсене по категории
    Given Клиента избира желана категория
    When Клиента клика върху меню категория 
    And Клиента клика върху желаната категория
    Then Вижда артикулите от тази категория

  Scenario: Добавяне на артикул
    Given Клиента добавя артикул
    When Клиента търси желания артикул
    And Клиента клика върху бутонна "add"
    Then Вижда съобщение “Успешно добавен артикул“

  Scenario: Не налечен размер
    Given Клиента избира желан размер
    When Клиента кликва върху бутон "size"
    And Ако нямя наличен размер
    Then Вижда съобщение “Няма наличен размер“
    
  Scenario: Разглеждане на артикулите които е добавил
    Given Клиента вижда екран за поръчката
    When Клиента кликва върху бутон "My order"
    Then Вижда екран с артикулите които е добавил
   
  Scenario: Завършване на поръчката
    Given Клиента решава да купи добавенита артикули в поръчката
    When Клиента въвежда коректни име и фамилия "Mitko Todorov"
    And Клиента въвежда коректен имейл "mitko_1089@abv.bg"
    And Клиента въвежда коректен адрес "Plovdiv, st.Macedoniq 63"
    And Клиента въвежда коректен телефон "0899799606"
    And Клиента кликва върху бутона "Buy"
    Then Вижда съобщение “Успешна поръчка“